app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "author", "source", "motto") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ravenclaw"], ["author", "JK Rowling"], ["source", "Harry Potter and the Sorcerer's Stone"], ["motto", "Wit beyond measure is man's greatest treasure"]]
---
  def create
    @house = House.new(name: params[:house][:name], author: params[:house][:author], source: params[:house][:source], motto: params[:house][:motto])
    if @house.save