app/controllers/members_controller.rb

INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Edmure"], ["last_name", "Tully"], ["house_id", 211], ["created_at", 2017-08-31 20:04:08 UTC], ["updated_at", 2017-08-31 20:04:08 UTC]]
---
  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house

    if @member.save